Repository: Git-Mohammed/Drosy-WebApi
Catalog: Drosy.Domain/Shared/ErrorComponents/Plans/Resources/ErrorMessages.Plan.*.resx
Languages: ar

# Error_Plan_StartDateRequired
source: Start date is required.
ar: تاريخ البدء مطلوب.

# Error_Plan_EndDateRequired
source: End date is required.
ar: تاريخ الانتهاء مطلوب.

# Error_Plan_StartSessionRequired
source: Start time of the session is required.
ar: وقت بدء الجلسة مطلوب.

# Error_Plan_EndSessionRequired
source: End time of the session is required.
ar: وقت انتهاء الجلسة مطلوب.

# Error_Plan_TotalFeesMustBePositive
source: Total fees must be greater than zero.
ar: إجمالي الرسوم يجب أن يكون أكبر من صفر.

# Error_Plan_InvalidSessionTimeRange
source: Start time must be before end time.
ar: وقت البدء يجب أن يكون قبل وقت الانتهاء.

# Error_Plan_InvalidDateRange
source: Start date must be before end date.
ar: تاريخ البدء يجب أن يكون قبل تاريخ الانتهاء.

# Error_Plan_DaysOfWeekRequired
source: At least one day of the week must be selected.
ar: يجب اختيار يوم واحد على الأقل من أيام الأسبوع.

# Error_Plan_PlanTypeNotSupported
source: This plan type is not supported.
ar: نوع الخطة غير مدعوم.

# Error_Plan_PlanInactive
source: The plan is inactive and cannot be used.
ar: الخطة غير مفعلة ولا يمكن استخدامها.

# Error_Plan_SessionTimeConflict
source: Another plan with the same session time exists on the selected days.
ar: توجد خطة أخرى بنفس توقيت الجلسة في الأيام المحددة.

# Error_Plan_PlanNotFound
source: The requested plan was not found.
ar: الخطة المطلوبة غير موجودة.

# Error_Plan_PlanCannotDeleteWithStudents
source: Cannot delete a plan that has registered students.
ar: لا يمكن حذف خطة تحتوي على طلاب مسجلين.

# Error_Plan_PlanSaveFailure
source: Failed to save the plan. Please try again.
ar: فشل في حفظ الخطة. يرجى المحاولة مرة أخرى.

# Error_Plan_ConstraintViolation
source: A database constraint was violated while processing the plan.
ar: تم انتهاك أحد قيود قاعدة البيانات أثناء معالجة الخطة.
